# Data Input & Output
(Adopted from Udemy Course, *Python for Data Science and Machine Learning Bootcamp* by Jose Portilla)

Install necessary packages:

conda install sqlalchemy 
conda install lxml
conda install html5lib
conda install BeautifulSoup4

In [1]:
import pandas as pd

In [2]:
# check directory
%pwd

'D:\\FYXIT Laptop\\Non-Default aka Real Shit\\Data Science\\Python-for-Data-Science\\Python for Data Analysis Foundation\\Pandas'

### CSV

**Reading from csv**

In [5]:
df = pd.read_csv("example")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

**Writing to csv**

In [6]:
df.to_csv("My_output")
pd.read_csv("My_output")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [7]:
# notice index is saved as a column...
# use index = False
df.to_csv("My_output", index=False)
pd.read_csv("My_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Excel 
Pandas can only import data, not image, formula, or macros, otherwise pandas might crash

In [22]:
df = pd.read_excel("Excel_Sample.xlsx", sheet_name="Sheet1")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

**Writing to excel**

In [12]:
df.to_excel("Excel_Sample2.xlsx", sheet_name = "NewSheet")
pd.read_excel("Excel_Sample2.xlsx", sheet_name = "NewSheet")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

notice you don't have to worry about the index getting saved as a column as you encountered in the csv case

### HTML

In [15]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
type(data)

list

In [18]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","December 19, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","December 19, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","December 19, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","December 19, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

Like seen, you have to find out which part of the list is the table you wanted

### SQL

you will need a driver library for your database, considering the wide ranges of options out ther

- psycopg2 for PostgreSQL
- pymysql for MySQL
- SQLite this is included in Python’s standard library by default

For more, can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])
    * Read SQL database table into a DataFrame.

* read_sql_query(sql, con[, index_col, ...])
    * Read SQL query into a DataFrame.

* read_sql(sql, con[, index_col, ...])
    * Read SQL query or database table into a DataFrame.

* DataFrame.to_sql(name, con[, flavor, ...])
    * Write records stored in a DataFrame to a SQL database.

In [19]:
# for demonstration, create a very simple sql engine
from sqlalchemy import create_engine

In [20]:
engine = create_engine("sqlite:///:memory:") # create a temporary, small sqlite engine

In [24]:
df.to_sql("my_table", con=engine)

In [26]:
sqldf = pd.read_sql("my_table", con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15